app/controllers/places_controller.rb

SELECT "places".* FROM "places" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "places"
---
  def index
    @places = Place.paginate(:page => params[:page], :per_page => 5)

INSERT INTO "places" ("address", "created_at", "description", "latitude", "longitude", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @place = current_user.places.create(place_params)

SELECT "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @place = Place.find(params[:id])

SELECT "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @place = Place.find(params[:id])

SELECT "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "places" SET "name" = $1, "description" = $2, "address" = $3, "updated_at" = $4 WHERE "places"."id" = 13
---
  def update
    @place = Place.find(params[:id])

    if @place.user != current_user
      return render text: 'Not Allowed', status: :forbidden
    end

    @place.update_attributes(place_params)