app/views/places/index.html.erb

    <p><%= place.description %></p><br />
    <% if place.user.present? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]

      <% end %>
      <% if place.comments.present? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."place_id" = $1 ORDER BY "comments"."id" DESC LIMIT 1  [["place_id", 1]]